---
date: 2024-04-03
category:
  - 数据库
tag:
  - Redis
excerpt: 五大基础数据类型内部实现及使用场景
order: 2
---

# 五大基础数据类型

## 字符串（String）

Redis 中 **所有的 key 都是字符串**，**最大不能超过 512M**

### 内部实现

底层的数据结构为 int 和 SDS，内部编码有 3 种 ：**int、embstr、raw**

![](.\md.assets\String.png)

<small>[Redis 常见数据类型和应用场景 - String](https://xiaolincoding.com/redis/data_struct/command.html)</small>

- int：保存 **整数值，且范围在 long 类型之内**，即 `-2^63 ~ 2^63 - 1`，超过则按字符串处理
  - 浮点数使用字符串保存
- embstr：保存字符串，且 **`字符串大小 ≤ 44 字节`**
- raw：保存字符串，且 **`字符串大小 ＞ 44 字节`**

```c
#define OBJ_ENCODING_EMBSTR_SIZE_LIMIT 44

robj *createStringObject(const char *ptr, size_t len) {
    // 小于等于 44 字节创建embstr对象，否则创建 raw 对象
    if (len <= OBJ_ENCODING_EMBSTR_SIZE_LIMIT)
        return createEmbeddedStringObject(ptr,len);
    else
        return createRawStringObject(ptr,len);
}
```

embstr 是专门针对短字符串进行优化的，与 raw 使用的是同一种数据结构（SDS）

- **embstr 是只读的**，一旦对字符串有任何修改，都会转变编码格式为 raw

但 embstr 与 raw 在内存分配策略上是不同的

- 创建 embstr 只需要分配一次，内存空间上是连续的，查找效率也更高，释放空间也只需要一次
- 创建 raw 需要分别分配两次内存空间，所以他在内存空间中不一定是连续的，且释放空间时也需要释放两次

```c
// embstr
robj *createEmbeddedStringObject(const char *ptr, size_t len) {
    // 只分配一次内存空间
    robj *o = zmalloc(sizeof(robj)+sizeof(struct sdshdr8)+len+1);

    ...
}
```

```c
// raw
robj *createRawStringObject(const char *ptr, size_t len) {
    // sdsnewlen 分配一次，createObject 分配一次
    return createObject(OBJ_STRING, sdsnewlen(ptr,len));
}
```

### 常用命令

```bash
# 为 key 赋值，如果 key 已存在，就覆盖，无视类型
set <key> <value>

# 获取 key 的值
get <key>

# 获取 key 所储存的字符串的长度
# 注意中文占两个字节
strlen <key>

# 为 key 赋值，并返回 key 的旧值（不常用）
getset <key> <value>

# 为 key 追加值，如果 key 不存在，就赋值为 value（不常用）
append <key> <value>

# 只在 key 不存在时，为 key 赋值
set <key> <value> nx
# 同
setnx hello world

# 只在 key 已经存在时，为 key 赋值
set <key> <value> xx

# 为 key 赋值，并设定过期时间（默认单位：秒）
set <key> <value> ex/px <seconds>/<milliseconds>
# 同
setex/psetex <key> <seconds>/<milliseconds> <value>

# 获取 key 的值，并设定过期时间（默认单位：秒）
getex <key> ex/px <seconds>/<milliseconds>
```

- 批量操作（不常用且不推荐）

```bash
# 批量为 key 赋值，如果 key 已存在，就覆盖，无视类型
mset <key> <value>...
# 例
> mset k1 1 k2 two k3 三

# 批量获取多个 key 的值
mget <key>...
# 例
> mget k1 k2 k3
1) "1"
2) "two"
3) "\xe4\xb8\x89"
```

- 计数器：**内部编码为 int 的时候可以使用**

```bash
# 将 key 中储存的数字增 1
# 如果 key 不存在，那么 key 的值会被初始化为 0，再执行操作
incr <key>
# 例
> incr number
(integer) 1

# 将 key 中储存的数字加上指定的增量值，可以为负值，同上
incrby <key> <increment>
# 例
> incrby number -10
(integer) -9

# 将 key 中储存的数字减 1，同上
decr <key>
# 例
> decr number
(integer) -10

# 将 key 中储存的数字减去指定的减量值，同上
decrby <key> <decrement>
# 例
> decr number -10
(integer) 0

# 将 key 中储存的数字加上指定的浮点数增量值，同上（不常用）
# 注意，使用该命令后内部编码会变为字符串
# 没有 decrbyfloat 命令
incrbyfloat <key> <increment>
# 例
> incrbyfloat number 0.1
"0.1"
```

### 使用场景

#### 缓存

最经典的使用场景

#### 计数器

因为 Redis 执行命令的过程是原子的，且字符串提供了计数方面的命令，所以字符串类型非常适合计数场景。例如统计访问次数、粉丝数、库存数量

#### 分布式锁

因为 Redis 执行命令的过程是原子的，非常适合分布式锁的加锁操作

```bash
set <key> <value> nx ex 60
```

#### 限流

为了限制接口的频繁调用，可以添加一个有过期时间的 key，在有效时间内忽略该用户对接口的请求，其实也就是缓存

## 哈希（Hash）

哈希是一个 field 和 value 的映射表，field 不能相同，value 可以相同，**特别适合存储对象**

### 内部实现

- 7.0 之前：**ziplist 和 hashtable**
- 7.0 之后：**listpack 和 hashtable**

当元素数量超过 `hash-max-listpack-entries`，默认值为 512，或元素大小超过 `hash-max-listpack-value`，默认值为 64 字节，由 listpack 改为 hashtable

- 即 **`元素数量 ＞ 512 || 元素大小 ＞ 64字节`**

### 常用命令

```bash
# 为哈希表中的字段赋值
hset <key> <field> <value>

# 只在 field 不存在时，为哈希表中的字段赋值
hsetnx <key> <field> <value>

# 返回哈希表中字段的值
hget <key> <field>

# 删除哈希表中的字段
hdel <key> <field>

# 查看哈希表的指定字段是否存在
hexists <key> <field>

# 返回哈希表中字段的数量
hlen <key>

# 返回哈希表中的所有的字段
hkeys <key>

# 返回哈希表所有字段的值
hvals <key>

# 返回哈希表中所有的字段和值
hgetall <key>

# 为哈希表中的字段值加上指定增量值，同 incrby
hincrby <key> <field> <increment>

# 为哈希表中的字段值加上指定浮点数增量值，同 incrbyfloat
hincrbyfloat <key> <field> <increment>

# 同时将多个 field-value 对设置到哈希表中
hmset <key> <field> <value>

# 批量获取哈希表中字段的值
hmget <key> <field>... 
```

### 使用场景

哈希类型的结构与对象的结构相似，且哈希结构相对于字符串序列化缓存信息更加直观，在更新操作上更加便捷。如果对象中的某些字段的值变化特别频繁，则哈希结构相比于字符串更有优势

## 列表（List）

列表是简单的字符串列表，内部实现为双向链表，可以从头部或尾部添加元素，元素是 **有序的、可重复的**

### 内部实现

- 3.2 之前：**linkedlist 和 ziplist**
- 3.2：**quicklist**
- 7.0 之后：**listpack**

### 常用命令

- 基本操作

```bash
# 将 value 插入到列表的表头（最左边）
lpush <key> <value>...

# 将 value 插入到列表的表尾（最右边）
rpush <key> <value>...

# 移除并返回列表的表头（最左边）
lpop <key>

# 移除并返回列表的表尾（最右边）
rpop <key>

# 返回列表的长度
llen <key>

# 返回包括 start 和 end 在内范围内的元素
lrange <key> <start> <end>

# 删除指定数量等于 value 的元素
# count > 0 表示从头开始查询，删除 count 个与 value 相等的元素
# count < 0 表示从尾开始查询，删除 count 绝对值个与 value 相等的元素
# count = 0 表示删除所有与 value 相等的元素
lrem <key> <count> <value>

# 修剪集合，只保留包括 start 和 end 在内范围内的元素
# 可以使用负数下标，-1 表示最后一个元素，-2 表示倒数第二个，以此类推
ltrim <key> <start> <end>

# 通过索引获取列表中的元素
# 可以使用负数下标
$ lindex <key> <index>

# 在列表的指定元素前或者后插入元素
linsert <key> before/after <value> <addValue>
# 例
> linsert hello before one 1.5
> linsert hello after one 0
> lrange hello 0 10
1) "three"
2) "two"
3) "1.5"
4) "one"
5) "0"

# 通过索引设置元素的值
# 可以使用负数下标
$ lset <key> <index> <value>
# 例
> lpush hello 1 1 2 1 1
> lset hello 2 250
> lset hello -2 999
1) "1"
2) "1"
3) "250"
4) "999"
5) "1"
```

- 阻塞操作

```bash
# 移除并返回列表的表头（最左边）
# lpop 的阻塞版本，如果列表没有元素，会阻塞列表直到等待超时或发现可弹出元素为止
# timeout 是阻塞超时时间，timeout 为 0 表示一直阻塞
$ blpop <key>... <timeout>
# 例
> blpop hello 10
1) "hello"
2) "three"
> blpop hello 10
1) "hello"
2) "two"
> blpop hello 10
1) "hello"
2) "one"
> blpop hello 10
(nil)
(10.02s)
# 阻塞了10秒后得到结果

# 移除并返回列表的表尾（最右边），同上
$ brpop <key> ... <timeout>
```

### 使用场景

列表不但有序，同时支持按照索引范围获取元素，关注列表，粉丝列表，消息列表等功能都可以用列表结构来实现。另外可以通过 `lrange` 命令，可以实现简单的高性能分页

- `lpush` + `lpop` = Stack（栈）
- `lpush` + `rpop` = Queue（队列）
- `lpush` + `ltrim` = Capped Collection（有限集合）
- `lpush` + `brpop` = Message Queue（消息队列）

## 集合（Set）

集合内的元素是 **无序且唯一** 的，Redis 除了支持集合内的操作，同时还 **支持集合间操作**，取交集、并集、差集

### 内部实现

- 7.2 之前：**intset 和 hashtable**
- 7.2 之后：**intset、listpack、hashtable**

当集合内只包含整数值元素，且元素数量不超过 `set-max-intset-entries`，默认值为 512，使用 intset

- 即 **`只包含整数值元素 && 元素数量 ≤ 512`**

当集合内元素数量超过 `set-max-listpack-entries`，默认值为 128，或元素大小超过 `set-max-listpack-entries`，默认值为 64 字节，由 listpack 改为 hashtable

- 即 **`元素数量 ＞ 128 || 元素大小 ＞ 64字节`**

### 常用命令

- 基本操作

```bash
# 将元素加入到集合中
sadd <key> <member>

# 移除集合中的元素
srem <key> <member>

# 返回集合中的所有元素
smembers <key>

# 返回集合中元素的数量
scard <key>

# 判断元素是否是集合的成员
sismember <key> <member>

# 随机移除集合中元素
spop <key>

# 随机返回集合中的元素
# 如果 count 为正数，返回指定 count 个，且小于等于总元素个数的数组
# 如果 count 为负数，返回 count 的绝对值个，可能会有重复的数组
srandmember <key> <count>
# 例
> sadd hello one two three
> srandmember hello 5
1) "one"
2) "two"
3) "three"
> srandmember hello -5
1) "one"
2) "three"
3) "two"
4) "three"
5) "one"
```

- 集合间操作

```bash
# 返回给定集合之间的差集/并集/交集
sdiff/sunion/sinter <key>...
# 例
> sadd aa one two three
> sadd bb three four five
> sdiff aa bb
1) "one"
2) "two"
> sdiff bb aa
1) "four"
2) "five"
> sunion aa bb
1) "one"
2) "two"
3) "three"
4) "four"
5) "five"
> sinter aa bb
1) "three"

# 将给定集合之间的差集/并集/交集存储在指定的集合 destkey 中
sdiffstore/sunionstore/sinterstore <destkey> <key>...
```

### 使用场景

#### 点赞

通过集合的唯一性，将文章的点赞记录存入集合中，可以用来判断用户是否点过赞，保证一个用户只能点一个赞

#### 共同关注

通过集合的交集运算来实现

- 集合的差集、并集和交集的计算复杂度较高，在数据量较大的情况下，如果直接执行这些计算，会导致 Redis 实例阻塞

#### 抽奖

通过集合唯一性，将参与者放入同一集合中，如果允许重复中奖可以使用 `srandmenber`，如果不允许重复中奖可以使用 `spop`

## 有序集合（Zset）

和集合相比，有序集合增加了一个 **权重分值 score**，使得集合中的元素能够按 score 进行有序排列。**score 可重复，元素不可重复**

### 内部实现

- Redis 7.0 之前：**ziplist 和 skiplist**
- Redis 7.0 之后：**listpack 和 skiplist**

当集合内元素数量超过 `zset-max-listpack-entries`，默认值为 128，或元素大小超过 `zset-max-listpack-entries`，默认值为 64 字节，由 listpack 改为 skiplist

- 即 **`元素数量 ＞ 128 || 元素大小 ＞ 64字节`**

### 常用命令

```bash
# 将成员元素及其分数值加入到有序集合当中
zadd <key> <score> <member>...

# 返回有序集合中元素的数量
zcard <key>

# 返回有序集合中成员的分数值
zscore <key> <member>

# 移除有序集合中的元素
zrem <key> <member>...

# 为有序集合中的成员权重参数 score 加上指定增量值
zincrby <key> <increment> <member>

# 返回有序集合中指定分数区间的成员数量，范围包括 min 和 max
zcount <key> <min> <max>

# 返回有序集合中指定成员的排名，按分数值递增/递减顺序排列，排名从 0 开始
# withscore 可选，可打印出元素的权重分值
zrank/zrevrank <key> <member> [withscore]
# 例
> zadd hello 1 one 2 two 3 three
> zrank hello one
(integer) 0
> zrevrank hello one
(integer) 2

# 返回有序集合中指定区间的成员，按分数值递增/递减顺序排列，分数相同按字典顺序排列
zrange/zrevrange <key> <start> <end> [withscores]

# 返回有序集合中指定分数区间的成员，按分数值递增/递减顺序排列
# limit 为指定返回结果的数量及区间
zrangebyscore/zrevrangebyscore <key> <min> <max> [withscores] [limit offset count]
# 例
> zadd hello 100 one 200 two 300 three 400 four
> zrangebyscore hello 150 999 limit 1 5
1) "three"
2) "four"

# 移除有序集合中指定区间内的所有成员
zremrangebyrank <key> <start> <end>

# 移除有序集合中指定分数区间内的所有成员
zremrangebyscore <key> <min> <max>
```

### 使用场景

- 排行榜：将需排行的数据以 score 的方式加入到有序集合中，可以通过 `zincrby` 后期调整分值，通过 `zrange/zrevrange`、`zrangebyscore/zrevrangebyscore`输出结果，还可根据参数进行分页

## 参考

- [2 万字 + 20张图｜ 细说 Redis 九种数据类型和应用场景](https://mp.weixin.qq.com/s/r9_0xpRsp2ubgyvpiyMfuw)
- [redis对数字/字符串append操作后，编码格式object encoding为什么从int/embstr变成raw了](https://blog.csdn.net/succing/article/details/120974681)
- [redis中embstr与raw编码方式之间的界限](https://blog.csdn.net/u013099854/article/details/115399466)
- [Redis GETEX 命令](https://www.linjiangxiong.com/2023/06/02/redis-cmd-strings-getex/index.html)
