---
icon: pen-to-square
date: 2024-04-03
category:
  - Redis
  - 数据库
tag:
  - Redis
excerpt: 五大基础数据类型
order: 2
---

# 数据类型

## 五大基础数据类型

### 1. 字符串（String）

Redis 中 **所有的 key 都是字符串**。字符串的值不仅可以是字符串，也可以是数字。**最大不能超过 512M**

#### 1.1 内部实现

底层的数据结构实现主要是 int 和 SDS，内部编码有 3 种 ：**int、embstr、raw**

![](.\md.assets\String.png)

<small>[Redis 常见数据类型和应用场景 - String](https://xiaolincoding.com/redis/data_struct/command.html)</small>

- int：保存 **整数值**，且范围在 long 类型之内，即 `-2^63 ~ 2^63 - 1`，超过则按字符串处理
  - 浮点数使用字符串保存
- embstr：保存字符串，且 **`字符串大小 ≤ 44 字节`**
- raw：保存字符串，且 **`字符串大小 ＞ 44 字节`**

```c
#define OBJ_ENCODING_EMBSTR_SIZE_LIMIT 44

robj *createStringObject(const char *ptr, size_t len) {
    // 小于等于44字节创建embstr对象，否则创建raw对象
    if (len <= OBJ_ENCODING_EMBSTR_SIZE_LIMIT)
        return createEmbeddedStringObject(ptr,len);
    else
        return createRawStringObject(ptr,len);
}
```

embstr 是专门针对短字符串进行优化的。他与 raw 使用的是同一种数据结构，但创建 raw 时需要分别分配两次内存空间，所以他在内存空间中不一定是连续的，且释放空间时也需要释放两次。而 embstr 只需要分配一次和释放一次，内存空间上是连续的，查找效率也更高

- embstr 是只读的，一旦对字符串有任何修改，都会转变编码格式为 raw

```c
// embstr
robj *createEmbeddedStringObject(const char *ptr, size_t len) {
    // 只分配一次内存空间
    robj *o = zmalloc(sizeof(robj)+sizeof(struct sdshdr8)+len+1);

    ...
}
```

```c
// raw
robj *createRawStringObject(const char *ptr, size_t len) {
    // sdsnewlen分配一次，createObject分配一次
    return createObject(OBJ_STRING, sdsnewlen(ptr,len));
}
```

#### 1.2 使用场景

##### 缓存

最经典的使用场景

##### 计数器

因为 Redis 执行命令的过程是原子的，且字符串提供了计数方面的命令，所以字符串类型非常适合计数场景。例如统计访问次数、粉丝数、库存数量

##### 分布式锁

因为 Redis 执行命令的过程是原子的，非常适合分布式锁的加锁操作

```bash
set <key> <value> nx ex 60
```

##### 限流

为了限制接口的频繁调用，可以添加一个有过期时间的 key，在有效时间内忽略该用户对接口的请求，其实也就是缓存

#### 1.3 常用命令

- 基本操作

```bash
# 为key赋值
# 如果key已经存储其他值，就覆写旧值，无视类型
set <key> <value>

# 获取指定key的值
get <key>

# 获取key所储存的字符串的长度
# 注意中文占两个字节
strlen <key>

# 为key赋值，并返回key的旧值（不常用）
getset <key> <value>

# 为key追加值，如果key不存在，就将给定的key赋值为value（不常用）
append <key> <value>

# 只在key不存在时，为key赋值
set <key> <value> nx
# 同
setnx hello world

# 只在key已经存在时，为key赋值
set <key> <value> xx

# 为key赋值，并设定过期时间（默认单位：秒）
set <key> <value> ex/px <seconds>/<milliseconds>
# 同
setex/psetex <key> <seconds>/<milliseconds> <value>
```

- 批量操作（不常用且不推荐）

```bash
# 批量为key赋值
# 如果key已经存储其他值，就覆写旧值，无视类型
mset <key> <value>...
# 例
> mset k1 1 k2 two k3 三

# 批量获取多个key的值
mget <key>...
# 例
> mget k1 k2 k3
1) "1"
2) "two"
3) "\xe4\xb8\x89"
```

- 计数器
  - **内部编码为 int 的时候可以使用**，即必须为整数，且范围在 `-2^63 ~ 2^63 - 1` 之内

```bash
# 将key中储存的数字增1
# 如果key不存在，那么key的值会被初始化为0，再执行操作
incr <key>
# 例
> incr number
(integer) 1

# 将key中储存的数字加上指定的增量值，可以为负值，同上
incrby <key> <increment>
# 例
> incrby number -10
(integer) -9

# 将key中储存的数字减1，同上
decr <key>
# 例
> decr number
(integer) -10

# 将key中储存的数字减去指定的减量值，同上
decrby <key> <decrement>
# 例
> decr number -10
(integer) 0

# 将key中储存的数字加上指定的浮点数增量值，同上（不常用）
# 没有decrbyfloat命令
# 注意，使用该命令后内部编码会变为字符串
incrbyfloat <key> <increment>
# 例
> incrbyfloat number 0.1
"0.1"
```

### 2. 哈希（Hash）

哈希是一个 field 和 value 的映射表，field 不能相同，value 可以相同，**特别适合存储对象**，后续操作时，并且可以直接修改这个对象中的某个字段的值

#### 2.1 内部实现

- 7.0 之前：**ziplist 和 hashtable**
- 7.0 之后：**listpack 和 hashtable**

当元素数量超过 `hash-max-listpack-entries`，默认值为 512，或元素大小超过 `hash-max-listpack-value`，默认值为 64 字节，由 listpack 改为 hashtable

- 即 **`元素数量 ＞ 512 || 元素大小 ＞ 64字节`**

#### 2.2 使用场景

哈希类型的结构与对象的结构相似，且哈希结构相对于字符串序列化缓存信息更加直观，在更新操作上更加便捷。如果对象中的某些字段的值变化特别频繁，则哈希结构相比于字符串更有优势

#### 2.3 常用命令

```bash
# 为哈希表中的字段赋值
hset <key> <field> <value>

# 只在field已经存在时，为哈希表中的字段赋值
hsetnx <key> <field> <value>

# 返回哈希表中字段的值
hget <key> <field>

# 删除哈希表中的字段
hdel <key> <field>

# 查看哈希表的指定字段是否存在
hexists <key> <field>

# 返回哈希表中字段的数量
hlen <key>

# 返回哈希表中的所有的字段
hkeys <key>

# 返回哈希表所有字段的值
hvals <key>

# 返回哈希表中所有的字段和值
hgetall <key>

# 为哈希表中的字段值加上指定增量值，同incrby
hincrby <key> <field> <increment>

# 为哈希表中的字段值加上指定浮点数增量值，同incrbyfloat
hincrbyfloat <key> <field> <increment>

# 同时将多个field-value对设置到哈希表中
hmset <key> <field> <value>

# 批量获取哈希表中字段的值
hmget <key> <field>... 
```

### 3. 列表（List）

列表是简单的字符串列表，列表中的每个字符串称为元素（element），可以从头部或尾部添加元素，元素是 **有序的、可重复的**，列表的最大长度为 `2^32 - 1`

#### 3.1 内部实现

- 3.2 之前：**linkedlist 和 ziplist**
- 3.2：**quicklist**
- 7.0 之后：**listpack**

#### 3.2 使用场景

列表不但有序，同时支持按照索引范围获取元素，关注列表，粉丝列表，消息列表等功能都可以用列表结构来实现。另外可以通过 `lrange` 命令，可以实现简单的高性能分页

- `lpush` + `lpop` = Stack（栈）
- `lpush` + `rpop` = Queue（队列）
- `lpush` + `ltrim` = Capped Collection（有限集合）
- `lpush` + `brpop` = Message Queue（消息队列）

#### 3.3 常用命令

- 基本操作

```bash
# 将value插入到列表的表头（最左边）
# 最后的值在最前面，即最前面的值最先插入
lpush <key> <value>...

# 将value插入到列表的表尾（最右边）
rpush <key> <value>...

# 只在key已经存在时，将value插入到列表的表头（最左边）
lpushx <key> <value>

# 只在key已经存在时，将value插入到列表的表尾（最右边）
rpushx <key> <value>

# 移除并返回列表的表头（最左边）
lpop <key>

# 移除并返回列表的表尾（最右边）
rpop <key>

# 返回列表的长度
llen <key>

# 返回列表中指定区间内的元素
# 截取范围由start和end两个偏移量决定，包括start和end在内
lrange <key> <start> <end>

# 在列表的指定元素前或者后插入元素
linsert <key> before/after <value> <addValue>
# 例
> linsert hello before one 1.5
> linsert hello after one 0
> lrange hello 0 10
1) "three"
2) "two"
3) "1.5"
4) "one"
5) "0"

# 通过索引设置元素的值
# 可以使用负数下标，-1表示最后一个元素，-2表示倒数第二个，以此类推
$ lset <key> <index> <value>
# 例
> lpush hello 1 1 2 1 1
> lset hello 2 250
> lset hello -2 999
1) "1"
2) "1"
3) "250"
4) "999"
5) "1"

# 通过索引获取列表中的元素
# 可以使用负数下标，-1表示最后一个元素，-2表示倒数第二个，以此类推
$ lindex <key> <index>
```

- 阻塞操作

```bash
# 移除并返回列表的表头（最左边）
# lpop的阻塞版本，如果列表没有元素，会阻塞列表直到等待超时或发现可弹出元素为止
# timeout是阻塞超时时间，timeout为0表示一直阻塞
$ blpop <key>... <timeout>
# 例
> blpop hello 10
1) "hello"
2) "three"
> blpop hello 10
1) "hello"
2) "two"
> blpop hello 10
1) "hello"
2) "one"
> blpop hello 10
(nil)
(10.02s)
# 阻塞了10秒后得到结果

# 移除并返回列表的表尾（最右边），同上
$ brpop <key> ... <timeout>
```

### 4. 集合（Set）

集合与列表类似，不同之处在于集合是 **无序且唯一** 的，集合的最大长度也与列表相同为 `2^32 - 1`。Redis 除了支持集合内的增删改查，同时还 **支持集合间操作**，取交集、并集、差集

#### 4.1 内部实现

- 7.2 之前：**intset 和 hashtable**
- 7.2 之后：**intset、listpack、hashtable**

当集合内只包含整数值元素，且元素数量不超过 `set-max-intset-entries`，默认值为 512，使用 intset

- 即 **`只包含整数值元素 && 元素数量 ≤ 512`**

当集合内元素数量超过 `set-max-listpack-entries`，默认值为 128，或元素大小超过 `set-max-listpack-entries`，默认值为 64 字节，由 listpack 改为 hashtable

- 即 **`元素数量 ＞ 128 || 元素大小 ＞ 64字节`**

#### 4.2 使用场景

##### 点赞

通过集合的唯一性，将文章的点赞记录存入集合中，可以用来判断用户是否点过赞，保证一个用户只能点一个赞

##### 共同关注

通过集合的交集运算来实现

- 集合的差集、并集和交集的计算复杂度较高，在数据量较大的情况下，如果直接执行这些计算，会导致 Redis 实例阻塞

##### 抽奖

通过集合唯一性，将参与者放入同一集合中，如果允许重复中奖可以使用 `srandmenber`，如果不允许重复中奖可以使用 `spop`

#### 4.3 常用命令

- 基本操作

```bash
# 将元素加入到集合中
sadd <key> <member>

# 移除集合中的元素
srem <key> <member>

# 返回集合中的所有元素
smembers <key>

# 返回集合中元素的数量
scard <key>

# 判断元素是否是集合的成员
sismember <key> <member>

# 随机移除集合中元素
spop <key>

# 随机返回集合中的元素
# 如果count为正数，返回指定count个，且小于等于总元素个数的数组
# 如果count为负数，返回count的绝对值个，可能会有重复的数组
srandmember <key> <count>
# 例
> sadd hello one two three
> srandmember hello 5
1) "one"
2) "two"
3) "three"
> srandmember hello -5
1) "one"
2) "three"
3) "two"
4) "three"
5) "one"
```

- 集合间操作

```bash
# 返回给定集合之间的差集/并集/交集
sdiff/sunion/sinter <key>...
# 例
> sadd aa one two three
> sadd bb three four five
> sdiff aa bb
1) "one"
2) "two"
> sdiff bb aa
1) "four"
2) "five"
> sunion aa bb
1) "one"
2) "two"
3) "three"
4) "four"
5) "five"
> sinter aa bb
1) "three"

# 将给定集合之间的差集/并集/交集存储在指定的集合destkey中
sdiffstore/sunionstore/sinterstore <destkey> <key>...
```

### 5. 有序集合（Zset）

和集合相比，有序集合增加了一个 **权重分值 score**，使得集合中的元素能够按 score 进行有序排列。**score 可重复，element 不可重复**

#### 5.1 内部实现

- Redis 7.0 之前：**ziplist 和 skiplist**
- Redis 7.0 之后：**listpack 和 skiplist**

当集合内元素数量超过 `zset-max-listpack-entries`，默认值为 128，或元素大小超过 `zset-max-listpack-entries`，默认值为 64 字节，由 listpack 改为 skiplist

- 即 **`元素数量 ＞ 128 || 元素大小 ＞ 64字节`**

#### 5.2 使用场景

- 排行榜：将需排行的数据以 score 的方式加入到有序集合中，可以通过 `zincrby` 后期调整分值，通过 `zrange/zrevrange`、`zrangebyscore/zrevrangebyscore`输出结果，还可根据参数进行分页

#### 5.3 常用命令

```bash
# 将成员元素及其分数值加入到有序集合当中
zadd <key> <score> <member>...

# 返回有序集合中元素的数量
zcard <key>

# 返回有序集合中成员的分数值
zscore <key> <member>

# 移除有序集合中的元素
zrem <key> <member>...

# 为有序集合中的成员权重参数score加上指定增量值
zincrby <key> <increment> <member>

# 返回有序集合中指定分数区间的成员数量，范围包括min和max
zcount <key> <min> <max>

# 返回有序集合中指定成员的排名，按分数值递增/递减顺序排列，排名从0开始
# withscore可选，可打印出元素的权重分值
zrank/zrevrank <key> <member> [withscore]
# 例
> zadd hello 1 one 2 two 3 three
> zrank hello one
(integer) 0
> zrevrank hello one
(integer) 2

# 返回有序集合中指定区间的成员，按分数值递增/递减顺序排列，分数相同按字典顺序排列
# withscores可选，可打印出元素的权重分值
zrange/zrevrange <key> <start> <end> [withscores]

# 返回有序集合中指定分数区间的成员，按分数值递增/递减顺序排列
# limit为指定返回结果的数量及区间，limit offset count
zrangebyscore/zrevrangebyscore <key> <min> <max> [withscores] [limit offset count]
# 例
> zadd hello 100 one 200 two 300 three 400 four
> zrangebyscore hello 150 999 limit 1 5
1) "three"
2) "four"

# 移除有序集合中指定区间内的所有成员
zremrangebyrank <key> <start> <end>

# 移除有序集合中指定分数区间内的所有成员
zremrangebyscore <key> <min> <max>
```

## 后续增加的数据类型

### 1. 位图（Bitmap）

2.2 版本新增。位图是一串连续的二进制数组，可以通过偏移量（offset）定位元素。位图通过最小的单位 bit 来进行 0 或 1 的设置，表示某个元素的值或者状态，使用它进行储存将 **非常节省空间**，特别适合一些数据量大且使用 **二值统计** 的场景

#### 1.1 使用场景

##### 签到统计

可以通过 `setbit`，将下标当做一年或一个月的某天，将签到的日子设置为 1，之后就可以使用 `getbit` 来判断某天是否签到；使用 `bitcount` 统计签到次数，还可以指定范围；还可以使用 `bitpos` 查找首次签到日期，当然具体的日期还得处理一下

##### 判断用户登录状态

将每个用户对应到某个唯一的下标中，就可通过 `setbit/getbit` 进行判断某个用户的登录状态

##### 连续签到用户总数

将日期作为 key，将每个用户对应到某个唯一的下标中，再通过 `bitop` 的与操作进行输出

#### 1.2 常用命令

```bash
# 设置值，value只能是0或1
setbit <key> <offset> <value>

# 获取值
getbit <key> <offset>

# 获取值为1的个数
# 可以指定范围和单位
bitcount <key> [<start> <end> [byte/bit]]

# 取与/或/异或/非结果到目标key
bitop and/or/xor/not <destKey> <key>...

# 返回指定key中第一次出现指定value(0/1)的位置
bitpos <key> <value> [<start> <end> [byte/bit]]
```

### 2. HyperLogLog

2.8 版本新增。HyperLogLog 是一种基数估计算法，可以在只使用很少内存空间的情况下， **近似的** 估计一个集合中 **不重复** 元素的数量，标准误差率是 0.81%

- 效率高，误差率低，内存占用小
- 结果不够精确，只能统计不重复的元素
  - 可以通过增加存储空间的大小来降低误差率
- 与布隆过滤器（Bloom Filter）的区别
  - 都是基数估计算法
  - HyperLogLog 适用于 **估计集合中不重复元素的数量**
  - 布隆过滤器适用于 **判断某个元素是否属于某个集合**

#### 2.1 使用场景

UV 计数（Unique View，独立访客）：将用户的唯一标识放入 HyperLogLog 中，再通过 `pfcount` 得到统计结果

#### 2.2 常用命令

```bash
# 添加元素到HyperLogLog中
pfadd <key> <value>...

# 返回基数估算值
pfcount <key>

# 合并多个key到目标key
pfmerge <destKey> <key>...
```

### 3. 地理信息定位（GEO）

3.2 版本新增。主要用于存储地理位置信息，并对存储的信息进行操作

#### 3.1 使用场景

- 附近的人：将用户的经纬度信息添加到集合中，通过 `georadius` 查找出附近的人

#### 3.2 常用命令

```bash
# 存储地理空间位置
geoadd <key> <longtitude> <latitude> <member>

# 获得key里指定member的地理空间位置
geopos <key> <member>...

# 返回两个位置间的距离
geodist <key> <member1> <member2> [m/km/ft/mi]

# 以给定的位置为中心，查找出半径内的元素
georadius <key> <longtitude> <latitude> <radius> m/km/ft/mi [withcoord/withdist/withhash] [count <count>] [asc/desc]
```

### 4. 流（Stream）

5.0 版本新增。专门为消息队列设计的数据类型。Redis 实现的消息队列，收发消息不会丢失，但如果 Redis 宕机的话消息可能会丢失，而且消息积压多的话，内存资源会紧张，建议使用专门的消息队列中间件

## 参考

- [2 万字 + 20张图｜ 细说 Redis 九种数据类型和应用场景](https://mp.weixin.qq.com/s/r9_0xpRsp2ubgyvpiyMfuw)
- [redis对数字/字符串append操作后，编码格式object encoding为什么从int/embstr变成raw了](https://blog.csdn.net/succing/article/details/120974681)
- [redis中embstr与raw编码方式之间的界限](https://blog.csdn.net/u013099854/article/details/115399466)
